% % matlab解线性规划
% 1.化标准型 
%     目标函数转化为最小值
%     约束条件转化为小于形式
% 2.使用函数[x,y] = linprog(f,a,b,Aeq,beq,lb,ub)
%     f 目标函数系数列向量
%     a 约束条件系数矩阵
%     b 约束条件常数列向量
%     Aeq 等式约束系数
%     beq 等式约束常数
%     lb，ub 决策变量上下界 用zeros(i,1)
%   例题 max z = 2x1 + 3x2 - 5x3
%        x1 + x2 + x3 = 7
%        2x1 - 5x2 + x3 >= 10
%        x1 + 3x2 + x3 <= 12
%        x1,x2,x3 >= 0

% 化标准型
% min z = -2x1 - 3x2 + 5x3
% -2x1 + 5x2 - x3 <= -10
% x1 + 3x2 + x3 <= 12
% x1 + x2 + x3 = 7
% x1,x2,x3 >= 0

% 使用函数
f =[-2;-3;5];
a = [-2,5,-1;1,3,1];
b = [-10;12 ];
Aeq = [1,1,1];
beq = 7;
[x,y] = linprog(f,a,b,Aeq,beq,zeros(3,1));
x;y = -y