% % 看起来不是线性规划的问题转换为线性规划问题
% 列如：
%     min |x1| + |x2| +...+ |xn|
%     s.t. Ax <= b
% 
% 因为：对于任意xi存在ui，vi >= 0
% 满足 xi = ui - vi    |xi| = ui + vi
% 所以：ui = （xi + |xi|）/ 2    vi = (|xi| - xi) / 2
% 
% 记 u = [u1,u2,...,un]'  v = [v1,v2,...,vn]'
% 则可以把上面的问题变成 
%     min nΣn-1 （ui + vi）
%             A(ui + vi) <= b 
%     s.t.    u,v >= 0

% 例题：
%      min z = |x1| + 2|x2| + 3|x3| + 4|x4|
%      s.t. x1 - x2 -x3 + x4 <= -2
%           x1 - x2 + x3 - 3x4 <= -1
%           x1 - x2 - 2x3 + 3x4 <= -1/2
f = 1:4;
f = [f,f]';%变化后的目标函数系数列向量
a = [1 -1 -1 1 ;1 -1 1 -3 ;1 -1 -2 3 ];
a = [a,-a];%变化后的约束条件系数矩阵
b = [-2 -1 -1/2];
[y,z] = linprog(f,a,b,[],[],zeros(8,1));
x = y(1:4) - y(5:end); %变化到原问题的解



          
  